In [1]:
import numpy as np
import pandas as pd

In [5]:
arr = np.array([["Bilişim", 3000, "Mustafa"],["İnsan Kaynakları",3500,"Jale"],["Üretim", 2500, "Kadir"],["Üretim",4500,"Zeynep"],["Bilişim",4000,"Murat"],["İnsan Kaynakları",2000,"Ahmet"]])

In [8]:
df = pd.DataFrame(data = arr,index = [i for i in range(6)], columns = "Departman Maaş Çalışan".split(" "))

In [9]:
df

          Departman  Maaş  Çalışan
0           Bilişim  3000  Mustafa
1  İnsan Kaynakları  3500     Jale
2            Üretim  2500    Kadir
3            Üretim  4500   Zeynep
4           Bilişim  4000    Murat
5  İnsan Kaynakları  2000    Ahmet

In [10]:
#groupby belli bir column değerine göre işlemler yapmayı sağlar

In [15]:
#ya da dataset = 
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Maaş":[3000,3500,2500,4500,4000,2000],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"]
        }

In [16]:
df = pd.DataFrame(dataset)

In [17]:
df

          Departman  Maaş  Çalışan
0           Bilişim  3000  Mustafa
1  İnsan Kaynakları  3500     Jale
2            Üretim  2500    Kadir
3            Üretim  4500   Zeynep
4           Bilişim  4000    Murat
5  İnsan Kaynakları  2000    Ahmet

In [18]:
DepGroup = df.groupby("Departman")

In [19]:
DepGroup

In [20]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [21]:
DepGroup.mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [22]:
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [23]:
df.groupby("Departman").mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [24]:
df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [25]:
int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [26]:
df.groupby("Departman").count()#iki çalışan iki maaş var demek

                  Maaş  Çalışan
Departman
Bilişim              2        2
Üretim               2        2
İnsan Kaynakları     2        2

In [27]:
df.groupby("Departman").max()

                  Maaş  Çalışan
Departman
Bilişim           4000  Mustafa
Üretim            4500   Zeynep
İnsan Kaynakları  3500     Jale

In [33]:
df.sum()

Departman    Bilişimİnsan KaynaklarıÜretimÜretimBilişimİnsa...
Maaş                                                     19500
Çalışan                       MustafaJaleKadirZeynepMuratAhmet
dtype: object

In [35]:
df.groupby("Çalışan").max()#????neden en yüksek maaşı göstermiyor?

                Departman  Maaş
Çalışan
Ahmet    İnsan Kaynakları  2000
Jale     İnsan Kaynakları  3500
Kadir              Üretim  2500
Murat             Bilişim  4000
Mustafa           Bilişim  3000
Zeynep             Üretim  4500

In [36]:
df["Hobi"] = "Yüzme Voleybol Voleybol Basketbol Dans Gitar".split(" ")

In [37]:
df

          Departman  Maaş  Çalışan       Hobi
0           Bilişim  3000  Mustafa      Yüzme
1  İnsan Kaynakları  3500     Jale   Voleybol
2            Üretim  2500    Kadir   Voleybol
3            Üretim  4500   Zeynep  Basketbol
4           Bilişim  4000    Murat       Dans
5  İnsan Kaynakları  2000    Ahmet      Gitar

In [41]:
df.drop("Hobi", axis = 1, inplace=True)

In [42]:
df.groupby("Departman").min()

                  Maaş Çalışan
Departman
Bilişim           3000   Murat
Üretim            2500   Kadir
İnsan Kaynakları  2000   Ahmet

In [46]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [47]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [48]:
df.groupby("Departman").mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [51]:
df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"]#Önce sütun sonra index(satır)

2750.0